Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
            = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)
      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "GET",
              - "HEAD",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [] -> null
          - max_age_seconds = 3000 -> null
        }

      ~ grant (known after apply)
      - grant {
          - id          = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-query-results" -> null
          - prefix                                 = "query-results/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-cached-results" -> null
          - prefix                                 = "query-responses/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 2 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket must be replaced
+/- resource "aws_s3_bucket" "variants-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::gaspi-variants-20250523065512938000000004" -> (known after apply)
      ~ bucket                      = "gaspi-variants-20250523065512938000000004" -> (known after apply)
      ~ bucket_domain_name          = "gaspi-variants-20250523065512938000000004.s3.amazonaws.com" -> (known after apply)
      ~ bucket_prefix               = "gaspi-variants-" -> "gasi-variants-" # forces replacement
      ~ bucket_regional_domain_name = "gaspi-variants-20250523065512938000000004.s3.ap-southeast-3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z01846753K324LI26A3VV" -> (known after apply)
      ~ id                          = "gaspi-variants-20250523065512938000000004" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "ap-southeast-3" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "Environment" = "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ cors_rule (known after apply)

      ~ grant (known after apply)
      - grant {
          - id          = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
            # (1 unchanged attribute hidden)
        }

      ~ lifecycle_rule (known after apply)
      - lifecycle_rule {
          - abort_incomplete_multipart_upload_days = 0 -> null
          - enabled                                = true -> null
          - id                                     = "clean-old-queries" -> null
          - prefix                                 = "variant-queries/" -> null
          - tags                                   = {} -> null

          - expiration {
              - days                         = 1 -> null
              - expired_object_delete_marker = false -> null
                # (1 unchanged attribute hidden)
            }
        }

      ~ logging (known after apply)

      ~ object_lock_configuration (known after apply)

      ~ replication_configuration (known after apply)

      ~ server_side_encryption_configuration (known after apply)
      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

      ~ versioning (known after apply)
      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }

      ~ website (known after apply)
    }

  # module.sbeacon.aws_s3_bucket_acl.dataportal_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "dataportal_bucket_acl" {
      ~ bucket                = "gaspi-dataportal-20250523065512727900000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250523065512727900000003,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.lambda-layers must be replaced
-/+ resource "aws_s3_bucket_acl" "lambda-layers" {
      ~ bucket                = "gaspi-lambda-layers-20250523065512281400000002" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-lambda-layers-20250523065512281400000002,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.metadata must be replaced
-/+ resource "aws_s3_bucket_acl" "metadata" {
      ~ bucket                = "gaspi-metadata-20250523065512230500000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250523065512230500000001,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_acl.variants_bucket_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "variants_bucket_acl" {
      ~ bucket                = "gaspi-variants-20250523065512938000000004" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-variants-20250523065512938000000004,private" -> (known after apply)
        # (2 unchanged attributes hidden)

      ~ access_control_policy (known after apply)
      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id            = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                  - type          = "CanonicalUser" -> null
                    # (3 unchanged attributes hidden)
                }
            }
          - owner {
              - id           = "38493f83982c97238663967cceb555e4e048a0bd5c3175b1a837432278384162" -> null
                # (1 unchanged attribute hidden)
            }
        }
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.dataportal-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "dataportal-bucket" {
      ~ bucket                = "gaspi-dataportal-20250523065512727900000003" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-dataportal-20250523065512727900000003" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_cors_configuration.metadata-bucket must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "metadata-bucket" {
      ~ bucket                = "gaspi-metadata-20250523065512230500000001" -> (known after apply) # forces replacement
      ~ id                    = "gaspi-metadata-20250523065512230500000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.metadata_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "metadata_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-metadata-20250523065512230500000001" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-metadata-20250523065512230500000001" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.staging_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "staging_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-dataportal-20250523065512727900000003" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-dataportal-20250523065512727900000003" -> (known after apply)
        # (1 unchanged attribute hidden)

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
              + prefix = "staging/"
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 1
            }
        }

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_lifecycle_configuration.variants_bucket_lifecycle must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "variants_bucket_lifecycle" {
      ~ bucket                                 = "gaspi-variants-20250523065512938000000004" -> (known after apply) # forces replacement
      + expected_bucket_owner                  = (known after apply)
      ~ id                                     = "gaspi-variants-20250523065512938000000004" -> (known after apply)
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be created
  + resource "aws_s3_bucket_notification" "updateFiles" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
              + "s3:ObjectRemoved:*",
            ]
          + filter_prefix       = "projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + filter_prefix       = "staging/projects/"
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.dataportal_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "dataportal_bucket_ownership_controls" {
      ~ bucket = "gaspi-dataportal-20250523065512727900000003" -> (known after apply) # forces replacement
      ~ id     = "gaspi-dataportal-20250523065512727900000003" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.lambda_layers_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "lambda_layers_bucket_ownership_controls" {
      ~ bucket = "gaspi-lambda-layers-20250523065512281400000002" -> (known after apply) # forces replacement
      ~ id     = "gaspi-lambda-layers-20250523065512281400000002" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.metadata_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "metadata_bucket_ownership_controls" {
      ~ bucket = "gaspi-metadata-20250523065512230500000001" -> (known after apply) # forces replacement
      ~ id     = "gaspi-metadata-20250523065512230500000001" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_ownership_controls.variants_bucket_ownership_controls must be replaced
-/+ resource "aws_s3_bucket_ownership_controls" "variants_bucket_ownership_controls" {
      ~ bucket = "gaspi-variants-20250523065512938000000004" -> (known after apply) # forces replacement
      ~ id     = "gaspi-variants-20250523065512938000000004" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_s3_bucket_versioning.dataportal-bucket will be created
  + resource "aws_s3_bucket_versioning" "dataportal-bucket" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be created
  + resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "clone-gaspi-notebooks"
      + on_create = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + on_start  = "IyEvYmluL2Jhc2gKCnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoK"
      + tags_all  = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_sns_topic.performQuery will be created
  + resource "aws_sns_topic" "performQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "performQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be created
  + resource "aws_sns_topic" "splitQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "splitQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.performQuery will be created
  + resource "aws_sns_topic_subscription" "performQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.aws_sns_topic_subscription.splitQuery will be created
  + resource "aws_sns_topic_subscription" "splitQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.security.aws_cloudwatch_event_rule.gaspi-inspector-findings[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_cloudwatch_event_rule" "gaspi-inspector-findings" {
      - arn                 = "arn:aws:events:ap-southeast-3:438465168484:rule/gaspi-inspector-findings" -> null
      - description         = "Triggers on new Amazon Inspector Findings" -> null
      - event_bus_name      = "default" -> null
      - event_pattern       = jsonencode(
            {
              - detail-type = [
                  - "Inspector2 Finding",
                ]
              - source      = [
                  - "aws.inspector2",
                ]
            }
        ) -> null
      - force_destroy       = false -> null
      - id                  = "gaspi-inspector-findings" -> null
      - is_enabled          = true -> null
      - name                = "gaspi-inspector-findings" -> null
      - state               = "ENABLED" -> null
      - tags                = {} -> null
      - tags_all            = {
          - "Environment" = "uat"
          - "NAME"        = "security-infrastructure"
          - "Owner"       = "gaspi"
        } -> null
        # (3 unchanged attributes hidden)
    }

  # module.security.aws_inspector2_enabler.gaspi-inspector-enabler[0] will be destroyed
  # (because index [0] is out of range for count)
  - resource "aws_inspector2_enabler" "gaspi-inspector-enabler" {
      - account_ids    = [
          - "438465168484",
        ] -> null
      - id             = "438465168484-ECR:LAMBDA" -> null
      - resource_types = [
          - "ECR",
          - "LAMBDA",
        ] -> null
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be created
  + resource "aws_wafv2_web_acl" "security-all-cloudfront" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "WAF to be applied to all cloudfront distributions"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "security-all-cloudfront"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "security-infrastructure"
          + "Owner"       = "gaspi"
        }

      + default_action {
          + allow {
            }
        }

      + rule {
          + name     = "security-all-cloudfront-IP-rate-limiting"
          + priority = 1

          + action {
              + block {
                }
            }

          + statement {
              + rate_based_statement {
                  + aggregate_key_type    = "IP"
                  + evaluation_window_sec = 300
                  + limit                 = 1000
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-IP-rate-limiting-rule-metric"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "security-all-cloudfront-common-ruleset"
          + priority = 2

          + override_action {
              + none {}
            }

          + statement {
              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesCommonRuleSet"
                  + vendor_name = "AWS"
                    # (1 unchanged attribute hidden)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "security-all-cloudfront-common-ruleset-rule-metric"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "security-all-cloudfront-metric"
          + sampled_requests_enabled   = true
        }
    }

  # module.svep[0].data.aws_iam_policy_document.ec2_references_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_references_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-clearTempAndRegions will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-clearTempAndRegions" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001",
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeStream",
              + "dynamodb:GetRecords",
              + "dynamodb:GetShardIterator",
              + "dynamodb:ListStreams",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concat will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concat" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-createPages",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-concatStarter will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-concatStarter" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-concat",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-concatStarter",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001",
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-createPages will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-createPages" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-concatPages",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-createPages",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-formatOutput will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-formatOutput" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-getResultsURL will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-getResultsURL" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-initQuery will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-initQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-concatStarter",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginClinvar will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginClinvar" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginGnomad",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginConsequence will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginConsequence" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginClinvar",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250523065507303800000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-pluginGnomad will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-pluginGnomad" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-formatOutput",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginGnomad",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-qcFigures will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-qcFigures" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryGTF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryGTF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-pluginConsequence",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryVCFsubmit",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCFsubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCFsubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250523065507430500000005",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:438465168484:svep-backend-updateReferenceFiles",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::438465168484:role/svep_backend_ec2_references_instance_role",
            ]
        }
    }

  # module.svep[0].aws_api_gateway_authorizer.svep_user_pool_authorizer will be created
  + resource "aws_api_gateway_authorizer" "svep_user_pool_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "sbeacon-userpool-authorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = "fr0h77aedl"
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.svep[0].aws_api_gateway_deployment.VPApi will be created
  + resource "aws_api_gateway_deployment" "VPApi" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = "fr0h77aedl"
      + triggers      = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.results-get will be created
  + resource "aws_api_gateway_integration" "results-get" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "fyto2l"
      + rest_api_id             = "fr0h77aedl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-patch will be created
  + resource "aws_api_gateway_integration" "submit-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "w7xtcw"
      + rest_api_id             = "fr0h77aedl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.submit-post will be created
  + resource "aws_api_gateway_integration" "submit-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "w7xtcw"
      + rest_api_id             = "fr0h77aedl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-patch will be created
  + resource "aws_api_gateway_integration" "vcfstats-patch" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "PATCH"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "hxdr94"
      + rest_api_id             = "fr0h77aedl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration.vcfstats-post will be created
  + resource "aws_api_gateway_integration" "vcfstats-post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = "hxdr94"
      + rest_api_id             = "fr0h77aedl"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.svep[0].aws_api_gateway_integration_response.results-get will be created
  + resource "aws_api_gateway_integration_response" "results-get" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + resource_id        = "fyto2l"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "fr0h77aedl"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-patch will be created
  + resource "aws_api_gateway_integration_response" "submit-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = "w7xtcw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "fr0h77aedl"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.submit-post will be created
  + resource "aws_api_gateway_integration_response" "submit-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "w7xtcw"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "fr0h77aedl"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-patch will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-patch" {
      + http_method        = "PATCH"
      + id                 = (known after apply)
      + resource_id        = "hxdr94"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "fr0h77aedl"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_integration_response.vcfstats-post will be created
  + resource "aws_api_gateway_integration_response" "vcfstats-post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + resource_id        = "hxdr94"
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = "fr0h77aedl"
      + status_code        = "200"
    }

  # module.svep[0].aws_api_gateway_method.results-get will be created
  + resource "aws_api_gateway_method" "results-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = "fyto2l"
      + rest_api_id      = "fr0h77aedl"
    }

  # module.svep[0].aws_api_gateway_method.submit-patch will be created
  + resource "aws_api_gateway_method" "submit-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
      + resource_id      = "w7xtcw"
      + rest_api_id      = "fr0h77aedl"
    }

  # module.svep[0].aws_api_gateway_method.submit-post will be created
  + resource "aws_api_gateway_method" "submit-post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = "w7xtcw"
      + rest_api_id      = "fr0h77aedl"
    }

  # module.svep[0].aws_api_gateway_method.vcfstats-patch will be created
  + resource "aws_api_gateway_method" "vcfstats-patch" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "PATCH"
      + id               = (known after apply)
    
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.